---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShape
source: html/de73d952-f626-9f32-df4a-b59eef6d0108.htm
---
# RebarShape Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.